new-handout/clustering-trees/handout-clustering.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Bio 723: Clustering I</title>
<!-- 2014-11-03 Mon 23:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Magwene" />
</head>
<body>
<div id="content">
<h1 class="title">Bio 723: Clustering I</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Dissimilarity measures</a>
<ul>
<li><a href="#sec-1-1">1.1. Dissimilarity measures in R</a></li>
<li><a href="#sec-1-2">1.2. Dissimilarity Measures in Python</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Hierarchical Clustering</a>
<ul>
<li><a href="#sec-2-1">2.1. Hierarchical clustering in R</a></li>
<li><a href="#sec-2-2">2.2. Hierarchical clustering in Python</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Minimum Spanning Trees</a></li>
<li><a href="#sec-4">4. Neighbor Joining Trees</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dissimilarity measures</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Dissimilarity measures in R</h3>
<div class="outline-text-3" id="text-1-1">
<p>
R includes a function, <code>dist()</code>, for calculating some of the most basic dissimilarity measures including Euclidean, Minkowski, and Manhattan metrics among others. The typical input to <code>dist()</code> is a data frame or matrix and a <code>method</code> argument specifying the type of distance measure to use. The <code>upper</code> argument specifies whether the upper diagonal of the calculated distance matrix should be printed (by default only the lower diagonal is printed).
</p>

<p>
To start with let's create a small \(4 \times 3\) matrix where we can easily calculate the distances between the 4 points by pencil and paper.
</p>

<div class="org-src-container">

<pre class="src src-R"># create a 4 x 3 matrix
z &lt;- matrix(c(0,0,0,
              1,0,0,
              0,1,0,
              0,0,1), 4, 3, byrow=T)
dist(z)
</pre>
</div>

<pre class="example">
         1        2        3
2 1.000000                  
3 1.000000 1.414214         
4 1.000000 1.414214 1.414214
</pre>

<p>
The default distance measure is Euclidean distance.  Let's apply Manhattan distance to the same matrix.
</p>

<div class="org-src-container">

<pre class="src src-R">dist(z, method='manhattan')
</pre>
</div>

<pre class="example">
  1 2 3
2 1    
3 1 2  
4 1 2 2
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Dissimilarity Measures in Python</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The SciPy module <code>scipy.spatial.distance</code> (see the <a href="http://docs.scipy.org/doc/scipy-0.14.0/reference/spatial.distance.html">SciPy</a> manual) supports computation of a large number of dissimilarity measures. The primary function is <code>pdist()</code> which computes pairwise distances between observations (rows) of an array.
</p>

<div class="org-src-container">

<pre class="src src-python">import numpy as np
from scipy.spatial import distance

z = np.array ([[0,0,0],
               [1,0,0],
               [0,1,0],
               [0,0,1]], dtype=np.float)
D = distance.pdist(z)
D
</pre>
</div>

<pre class="example">
array([ 1.        ,  1.        ,  1.        ,  1.41421356,  1.41421356,
        1.41421356])
</pre>

<p>
SciPy's <code>pdist()</code> function returns a condensed representation of the corresponding distance matrix, corresponding to the elements of the lower triangle of the distance matrix.  To convert this condensed form to a more standard square matrix we can use the <code>squareform()</code> function defined in the same module. 
</p>


<div class="org-src-container">

<pre class="src src-python">from scipy.spatial.distance import pdist, squareform
squareform(pdist(z))
</pre>
</div>

<pre class="example">
array([[ 0.        ,  1.        ,  1.        ,  1.        ],
       [ 1.        ,  0.        ,  1.41421356,  1.41421356],
       [ 1.        ,  1.41421356,  0.        ,  1.41421356],
       [ 1.        ,  1.41421356,  1.41421356,  0.        ]])
</pre>

<p>
As with the R function <code>dist</code>, the default distance measure is Euclidean distance.  <code>pdist</code> can use a wide range of other distance measures as illustrated here:
</p>

<div class="org-src-container">

<pre class="src src-python">print "Cityblock (Manhattan) distance: "
print squareform(pdist(z, "cityblock"))
print
print "Hamming distance: " 
print squareform(pdist(z, "hamming"))
print
print "Chebyshev distance: "
print squareform(pdist(z, "chebyshev"))
</pre>
</div>

<pre class="example">
Cityblock (Manhattan) distance:
[[ 0.  1.  1.  1.]
 [ 1.  0.  2.  2.]
 [ 1.  2.  0.  2.]
 [ 1.  2.  2.  0.]]

Hamming distance:
[[ 0.          0.33333333  0.33333333  0.33333333]
 [ 0.33333333  0.          0.66666667  0.66666667]
 [ 0.33333333  0.66666667  0.          0.66666667]
 [ 0.33333333  0.66666667  0.66666667  0.        ]]

Chebyshev distance:
[[ 0.  1.  1.  1.]
 [ 1.  0.  1.  1.]
 [ 1.  1.  0.  1.]
 [ 1.  1.  1.  0.]]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Hierarchical Clustering</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Hierarchical clustering in R</h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Hierarchical clustering in Python</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Minimum Spanning Trees</h2>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Neighbor Joining Trees</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Magwene</p>
<p class="date">Created: 2014-11-03 Mon 23:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
